stellarbeing22/stm32f1xx-drivers-/stm32f103xxDrivers/drivers/inc/stm32f103xx_i2c_drivers.h
/*
 * stm32f103xx_i2c_drivers.h
 *
 *  Created on: Oct 19, 2025
 *      Author: stellarbeing22
 *
========================================================================================================================
                                             FILE INDEX : stm32f103xx_spi_drivers.h
========================================================================================================================

1.  Includes and Header Guards
    1.1  Include dependency: stm32f103xx.h
    1.2  Header guards: INC_STM32F103XX_SPI_DRIVERS_H_

2.  Data Structures
    2.1  I2C_Config_t
         - Configuration parameters: I2C_SCLSpeed, I2C_DeviceAddress, I2C_ACKControl, I2C_FMDutyCycle
    2.2  I2C_Handler_t
         - Pointers and state tracking: *pI2Cx, I2C_Config

3.  Macros
	3.1  SCL Speed
		 - I2C_SCL_SPEED_SM,  I2C_SCL_SPEED_FM2K, I2C_SCL_SPEED_FM4K
	3.2  ACK Control
		 - I2C_ACK_ENABLE, I2C_ACK_DISABLE
	3.3  FM Duty cycle
		 - I2C_DUTY_2, I2C_DUTY_16_9

4.  Driver API Prototypes
    4.1  Peripheral clock control

 */

#ifndef INC_STM32F103XX_I2C_DRIVERS_H_
#define INC_STM32F103XX_I2C_DRIVERS_H_

/* =========================================================================
 * 1.Includes & Basic Macros
 * =========================================================================*/

#include "stm32f103xx.h"


/* =========================================================================
 * 2.Data Structures
 * =========================================================================*/

//2.1
typedef struct
{
	uint32_t I2C_SCLSpeed;      //@ 3.1
	uint8_t  I2C_DeviceAddress; //Set by the user
	uint8_t  I2C_ACKControl;    //@ 3.2
	uint16_t I2C_FMDutyCycle;   //@ 3.3
}I2C_Config_t;

typedef struct
{
	I2C_RegDef_t *pI2Cx;
	I2C_Config_t  I2C_Config;
}I2C_Handler_t;

/* =========================================================================
 * 3. Macros
 * =========================================================================*/

//3.1
//SCL Speed

#define I2C_SCL_SPEED_SM                    100000   //SM = Standard Mode @ 100KHz
#define I2C_SCL_SPEED_FM2K                  200000   //FM = Fast Mode @ 200KHz
#define I2C_SCL_SPEED_FM4K                  400000   //FM = Fast Mode @ 400KHz

//3.2
//ACK Control
#define I2C_ACK_ENABLE                      1         //Enables Acknowledge
#define I2C_ACK_DISABLE                     0         //Diables Acknowledge

//3.3
//FM Duty cycle
#define I2C_DUTY_2                         0          //tlow /thigh = 2
#define I2C_DUTY_16_9                      1          //tlow /thigh = 16/9 (see CCR)



/***********************************************************************************************************************
 *                                           API SUPPORTED BY THE DRIVER
 *                          FOR MORE INFORMATION ABOUT THE APIs CHECK THE FUNCTION DEFINITION
 ***********************************************************************************************************************/


/* GPIO peripheral clock */
void I2C_PeriClockControl(I2C_RegDef_t *pI2Cx, uint8_t En_or_Di);

/* Init and Deinit */

void I2C_init(I2C_Handler_t *pI2CHandle);
void I2C_Deinit(SPI_RegDef_t *pSPIx);

/* Data send and receive */


/* IQR config and ISR handling */
void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t En_or_Di);
void I2C_IRQPriorityConfig(uint8_t IRQNumber,uint32_t IRQPriority);

/* Other Peripheral Control APIs */
uint8_t I2C_GetFlagStatus(I2C_RegDef_t *pI2Cx, uint32_t FlagName);
void I2C_PeripheralControl(I2C_RegDef_t *pI2Cx, uint8_t En_Or_Di);

/*Application event*/
 void I2C_ApplicationEventCallback(I2C_Handler_t *pI2CHandle,uint8_t AppEve);

/*RCC*/
uint32_t RCC_getPCLK1value();
uint32_t RCC_getPLLOutputClk(); //Not implimented

#endif /* INC_STM32F103XX_I2C_DRIVERS_H_ */





